{"cells":[{"cell_type":"code","execution_count":1,"id":"c3916582","metadata":{"colab":{"base_uri":"https://localhost:8080/","height":356},"id":"c3916582","executionInfo":{"status":"error","timestamp":1745654476439,"user_tz":-480,"elapsed":1962,"user":{"displayName":"Yunqing Zhu","userId":"16942429739340561233"}},"outputId":"e6aa34a0-256d-4a00-a406-8d29e0e25178"},"outputs":[{"output_type":"error","ename":"FileNotFoundError","evalue":"[Errno 2] No such file or directory: 'Cleaned_data.csv'","traceback":["\u001b[0;31m---------------------------------------------------------------------------\u001b[0m","\u001b[0;31mFileNotFoundError\u001b[0m                         Traceback (most recent call last)","\u001b[0;32m<ipython-input-1-1261c9b2c6b9>\u001b[0m in \u001b[0;36m<cell line: 0>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      2\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      3\u001b[0m \u001b[0;31m# Read 100000 rows for demo\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 4\u001b[0;31m \u001b[0mdf\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mpd\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread_csv\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Cleaned_data.csv\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mnrows\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;36m100000\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      5\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      6\u001b[0m \u001b[0;31m# double confirming for cleaning\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.11/dist-packages/pandas/io/parsers/readers.py\u001b[0m in \u001b[0;36mread_csv\u001b[0;34m(filepath_or_buffer, sep, delimiter, header, names, index_col, usecols, dtype, engine, converters, true_values, false_values, skipinitialspace, skiprows, skipfooter, nrows, na_values, keep_default_na, na_filter, verbose, skip_blank_lines, parse_dates, infer_datetime_format, keep_date_col, date_parser, date_format, dayfirst, cache_dates, iterator, chunksize, compression, thousands, decimal, lineterminator, quotechar, quoting, doublequote, escapechar, comment, encoding, encoding_errors, dialect, on_bad_lines, delim_whitespace, low_memory, memory_map, float_precision, storage_options, dtype_backend)\u001b[0m\n\u001b[1;32m   1024\u001b[0m     \u001b[0mkwds\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mupdate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mkwds_defaults\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1025\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1026\u001b[0;31m     \u001b[0;32mreturn\u001b[0m \u001b[0m_read\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mfilepath_or_buffer\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkwds\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1027\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1028\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.11/dist-packages/pandas/io/parsers/readers.py\u001b[0m in \u001b[0;36m_read\u001b[0;34m(filepath_or_buffer, kwds)\u001b[0m\n\u001b[1;32m    618\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    619\u001b[0m     \u001b[0;31m# Create the parser.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 620\u001b[0;31m     \u001b[0mparser\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mTextFileReader\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mfilepath_or_buffer\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwds\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    621\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    622\u001b[0m     \u001b[0;32mif\u001b[0m \u001b[0mchunksize\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0miterator\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.11/dist-packages/pandas/io/parsers/readers.py\u001b[0m in \u001b[0;36m__init__\u001b[0;34m(self, f, engine, **kwds)\u001b[0m\n\u001b[1;32m   1618\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1619\u001b[0m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhandles\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mIOHandles\u001b[0m \u001b[0;34m|\u001b[0m \u001b[0;32mNone\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1620\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_engine\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_make_engine\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mf\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mengine\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1621\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1622\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mclose\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m->\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.11/dist-packages/pandas/io/parsers/readers.py\u001b[0m in \u001b[0;36m_make_engine\u001b[0;34m(self, f, engine)\u001b[0m\n\u001b[1;32m   1878\u001b[0m                 \u001b[0;32mif\u001b[0m \u001b[0;34m\"b\"\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mmode\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1879\u001b[0m                     \u001b[0mmode\u001b[0m \u001b[0;34m+=\u001b[0m \u001b[0;34m\"b\"\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1880\u001b[0;31m             self.handles = get_handle(\n\u001b[0m\u001b[1;32m   1881\u001b[0m                 \u001b[0mf\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1882\u001b[0m                 \u001b[0mmode\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;32m/usr/local/lib/python3.11/dist-packages/pandas/io/common.py\u001b[0m in \u001b[0;36mget_handle\u001b[0;34m(path_or_buf, mode, encoding, compression, memory_map, is_text, errors, storage_options)\u001b[0m\n\u001b[1;32m    871\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mioargs\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mencoding\u001b[0m \u001b[0;32mand\u001b[0m \u001b[0;34m\"b\"\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mioargs\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmode\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    872\u001b[0m             \u001b[0;31m# Encoding\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 873\u001b[0;31m             handle = open(\n\u001b[0m\u001b[1;32m    874\u001b[0m                 \u001b[0mhandle\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    875\u001b[0m                 \u001b[0mioargs\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmode\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n","\u001b[0;31mFileNotFoundError\u001b[0m: [Errno 2] No such file or directory: 'Cleaned_data.csv'"]}],"source":["import pandas as pd\n","\n","# Read 100000 rows for demo\n","df = pd.read_csv(\"Cleaned_data.csv\", nrows=100000)\n","\n","# double confirming for cleaning\n","df['Incident_zip'] = df['Incident_zip'].astype(str).str.strip()\n","df['Incident_zip'] = df['Incident_zip'].fillna('UNKNOWN')\n","df['Complaint_type'] = df['Complaint_type'].fillna('UNKNOWN')\n","\n","\n","print(df.head())\n"]},{"cell_type":"code","execution_count":null,"id":"374299be","metadata":{"id":"374299be","outputId":"afbe9f99-d9e0-4788-ffd5-791e7b0010bb"},"outputs":[{"name":"stdout","output_type":"stream","text":["  Incident_zip          Complaint_type  count\n","0        10000            DAMAGED TREE      1\n","1        10000         ILLEGAL PARKING      1\n","2        10000      NOISE - HELICOPTER      2\n","3        10000      SIDEWALK CONDITION      1\n","4        10000  STREET LIGHT CONDITION     10\n"]}],"source":["\n","complaint_counts = df.groupby(['Incident_zip', 'Complaint_type']).size().reset_index(name='count')\n","\n","\n","print(complaint_counts.head())\n"]},{"cell_type":"markdown","id":"bbe51f1b","metadata":{"id":"bbe51f1b"},"source":[" ### connect to neo4j"]},{"cell_type":"code","source":["!pip install py2neo"],"metadata":{"id":"YaTwFGdprP2s","executionInfo":{"status":"ok","timestamp":1745647118867,"user_tz":-480,"elapsed":4175,"user":{"displayName":"Yunqing Zhu","userId":"16942429739340561233"}},"outputId":"63989f8b-a362-4a5d-e7f5-5ad09c3be771","colab":{"base_uri":"https://localhost:8080/"}},"id":"YaTwFGdprP2s","execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting py2neo\n","  Downloading py2neo-2021.2.4-py2.py3-none-any.whl.metadata (9.9 kB)\n","Requirement already satisfied: certifi in /usr/local/lib/python3.11/dist-packages (from py2neo) (2025.1.31)\n","Collecting interchange~=2021.0.4 (from py2neo)\n","  Downloading interchange-2021.0.4-py2.py3-none-any.whl.metadata (1.9 kB)\n","Collecting monotonic (from py2neo)\n","  Downloading monotonic-1.6-py2.py3-none-any.whl.metadata (1.5 kB)\n","Requirement already satisfied: packaging in /usr/local/lib/python3.11/dist-packages (from py2neo) (24.2)\n","Collecting pansi>=2020.7.3 (from py2neo)\n","  Downloading pansi-2024.11.0-py2.py3-none-any.whl.metadata (3.1 kB)\n","Requirement already satisfied: pygments>=2.0.0 in /usr/local/lib/python3.11/dist-packages (from py2neo) (2.18.0)\n","Requirement already satisfied: six>=1.15.0 in /usr/local/lib/python3.11/dist-packages (from py2neo) (1.17.0)\n","Requirement already satisfied: urllib3 in /usr/local/lib/python3.11/dist-packages (from py2neo) (2.3.0)\n","Requirement already satisfied: pytz in /usr/local/lib/python3.11/dist-packages (from interchange~=2021.0.4->py2neo) (2025.2)\n","Requirement already satisfied: pillow in /usr/local/lib/python3.11/dist-packages (from pansi>=2020.7.3->py2neo) (11.1.0)\n","Downloading py2neo-2021.2.4-py2.py3-none-any.whl (177 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m177.2/177.2 kB\u001b[0m \u001b[31m4.0 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hDownloading interchange-2021.0.4-py2.py3-none-any.whl (28 kB)\n","Downloading pansi-2024.11.0-py2.py3-none-any.whl (26 kB)\n","Downloading monotonic-1.6-py2.py3-none-any.whl (8.2 kB)\n","Installing collected packages: monotonic, pansi, interchange, py2neo\n","Successfully installed interchange-2021.0.4 monotonic-1.6 pansi-2024.11.0 py2neo-2021.2.4\n"]}]},{"cell_type":"code","execution_count":null,"id":"7b4072eb","metadata":{"id":"7b4072eb","outputId":"754776ac-f45e-47b2-d224-110732911c20"},"outputs":[{"name":"stdout","output_type":"stream","text":["Progress: 1000/100000 rows imported.\n","Progress: 2000/100000 rows imported.\n","Progress: 3000/100000 rows imported.\n","Progress: 4000/100000 rows imported.\n","Progress: 5000/100000 rows imported.\n","Progress: 6000/100000 rows imported.\n","Progress: 7000/100000 rows imported.\n","Progress: 8000/100000 rows imported.\n","Progress: 9000/100000 rows imported.\n","Progress: 10000/100000 rows imported.\n","Progress: 11000/100000 rows imported.\n","Progress: 12000/100000 rows imported.\n","Progress: 13000/100000 rows imported.\n","Progress: 14000/100000 rows imported.\n","Progress: 15000/100000 rows imported.\n","Progress: 16000/100000 rows imported.\n","Progress: 17000/100000 rows imported.\n","Progress: 18000/100000 rows imported.\n","Progress: 19000/100000 rows imported.\n","Progress: 20000/100000 rows imported.\n","Progress: 21000/100000 rows imported.\n","Progress: 22000/100000 rows imported.\n","Progress: 23000/100000 rows imported.\n","Progress: 24000/100000 rows imported.\n","Progress: 25000/100000 rows imported.\n","Progress: 26000/100000 rows imported.\n","Progress: 27000/100000 rows imported.\n","Progress: 28000/100000 rows imported.\n","Progress: 29000/100000 rows imported.\n","Progress: 30000/100000 rows imported.\n","Progress: 31000/100000 rows imported.\n","Progress: 32000/100000 rows imported.\n","Progress: 33000/100000 rows imported.\n","Progress: 34000/100000 rows imported.\n","Progress: 35000/100000 rows imported.\n","Progress: 36000/100000 rows imported.\n","Progress: 37000/100000 rows imported.\n","Progress: 38000/100000 rows imported.\n","Progress: 39000/100000 rows imported.\n","Progress: 40000/100000 rows imported.\n","Progress: 41000/100000 rows imported.\n","Progress: 42000/100000 rows imported.\n","Progress: 43000/100000 rows imported.\n","Progress: 44000/100000 rows imported.\n","Progress: 45000/100000 rows imported.\n","Progress: 46000/100000 rows imported.\n","Progress: 47000/100000 rows imported.\n","Progress: 48000/100000 rows imported.\n","Progress: 49000/100000 rows imported.\n","Progress: 50000/100000 rows imported.\n","Progress: 51000/100000 rows imported.\n","Progress: 52000/100000 rows imported.\n","Progress: 53000/100000 rows imported.\n","Progress: 54000/100000 rows imported.\n","Progress: 55000/100000 rows imported.\n","Progress: 56000/100000 rows imported.\n","Progress: 57000/100000 rows imported.\n","Progress: 58000/100000 rows imported.\n","Progress: 59000/100000 rows imported.\n","Progress: 60000/100000 rows imported.\n","Progress: 61000/100000 rows imported.\n","Progress: 62000/100000 rows imported.\n","Progress: 63000/100000 rows imported.\n","Progress: 64000/100000 rows imported.\n","Progress: 65000/100000 rows imported.\n","Progress: 66000/100000 rows imported.\n","Progress: 67000/100000 rows imported.\n","Progress: 68000/100000 rows imported.\n","Progress: 69000/100000 rows imported.\n","Progress: 70000/100000 rows imported.\n","Progress: 71000/100000 rows imported.\n","Progress: 72000/100000 rows imported.\n","Progress: 73000/100000 rows imported.\n","Progress: 74000/100000 rows imported.\n","Progress: 75000/100000 rows imported.\n","Progress: 76000/100000 rows imported.\n","Progress: 77000/100000 rows imported.\n","Progress: 78000/100000 rows imported.\n","Progress: 79000/100000 rows imported.\n","Progress: 80000/100000 rows imported.\n","Progress: 81000/100000 rows imported.\n","Progress: 82000/100000 rows imported.\n","Progress: 83000/100000 rows imported.\n","Progress: 84000/100000 rows imported.\n","Progress: 85000/100000 rows imported.\n","Progress: 86000/100000 rows imported.\n","Progress: 87000/100000 rows imported.\n","Progress: 88000/100000 rows imported.\n","Progress: 89000/100000 rows imported.\n","Progress: 90000/100000 rows imported.\n","Progress: 91000/100000 rows imported.\n","Progress: 92000/100000 rows imported.\n","Progress: 93000/100000 rows imported.\n","Progress: 94000/100000 rows imported.\n","Progress: 95000/100000 rows imported.\n","Progress: 96000/100000 rows imported.\n","Progress: 97000/100000 rows imported.\n","Progress: 98000/100000 rows imported.\n","Progress: 99000/100000 rows imported.\n","Progress: 100000/100000 rows imported.\n","Data import completed!\n"]}],"source":["from py2neo import Graph, Node, Relationship\n","\n","#connect to neo4j\n","graph = Graph(\"bolt://localhost:7689\", auth=(\"neo4j\", \"12345678\"))\n","\n","# Import data and set the count field\n","def import_data_to_neo4j(df, graph):\n","    total_rows = len(df)\n","\n","    # Used for batch data insertion\n","    for index, row in df.iterrows():\n","        zip_code = row['Incident_zip']\n","        complaint_type = row['Complaint_type']\n","        borough = row['Borough']\n","\n","        # Retrieve the value of the count field\n","        count = row['count'] if 'count' in row else 1\n","\n","        # Create Node\n","        zip_node = Node(\"Zip\", code=zip_code)\n","        complaint_node = Node(\"ComplaintType\", type=complaint_type)\n","        borough_node = Node(\"Borough\", name=borough)\n","\n","        # Use merge to make sure no dupulicate node\n","        graph.merge(zip_node, \"Zip\", \"code\")\n","        graph.merge(complaint_node, \"ComplaintType\", \"type\")\n","        graph.merge(borough_node, \"Borough\", \"name\")\n","\n","        # createe count field\n","        has_complaint = Relationship(zip_node, \"HAS_COMPLAINT\", complaint_node)\n","        has_complaint['count'] = count\n","        located_in = Relationship(zip_node, \"LOCATED_IN\", borough_node)\n","\n","        # insert relationshsip\n","        graph.create(zip_node)\n","        graph.create(complaint_node)\n","        graph.create(borough_node)\n","        graph.create(has_complaint)\n","        graph.create(located_in)\n","\n","\n","        if (index + 1) % 1000 == 0:\n","            print(f\"Progress: {index + 1}/{total_rows} rows imported.\")\n","\n","# import data\n","import_data_to_neo4j(df, graph)\n","\n","print(\"Data import completed!\")\n"]},{"cell_type":"code","execution_count":null,"id":"eda16eed","metadata":{"id":"eda16eed","outputId":"ccf30ed8-f396-49ad-d563-bd9bb5047829"},"outputs":[{"name":"stdout","output_type":"stream","text":["Count fields updated successfully!\n"]}],"source":["from py2neo import Graph\n","\n","#connect to neo4j\n","graph = Graph(\"bolt://localhost:7689\", auth=(\"neo4j\", \"12345678\"))\n","\n","def update_count_in_neo4j(complaint_counts, graph):\n","    for index, row in complaint_counts.iterrows():\n","        zip_code = row['Incident_zip']\n","        complaint_type = row['Complaint_type']\n","        count = row['count']\n","\n","        #update count field\n","        graph.run(\"\"\"\n","        MATCH (z:Zip {code: $zip_code})-[r:HAS_COMPLAINT]->(c:ComplaintType {type: $complaint_type})\n","        SET r.count = $count\n","        \"\"\", zip_code=zip_code, complaint_type=complaint_type, count=count)\n","\n","    print(\"Count fields updated successfully!\")\n","\n","\n","update_count_in_neo4j(complaint_counts, graph)"]},{"cell_type":"code","execution_count":null,"id":"92c185cf","metadata":{"id":"92c185cf","outputId":"34333523-a985-4def-ed55-f3cfedabdd98"},"outputs":[{"name":"stdout","output_type":"stream","text":["Results:\n","ZIP Code: 10305, Complaint Type: HEAT/HOT WATER, Count: 28\n","ZIP Code: 11223, Complaint Type: HEAT/HOT WATER, Count: 131\n","ZIP Code: 11102, Complaint Type: HEAT/HOT WATER, Count: 86\n","ZIP Code: 10309, Complaint Type: HEAT/HOT WATER, Count: 1\n","ZIP Code: 11105, Complaint Type: HEAT/HOT WATER, Count: 49\n","ZIP Code: 10031, Complaint Type: HEAT/HOT WATER, Count: 458\n","ZIP Code: 10016, Complaint Type: HEAT/HOT WATER, Count: 49\n","ZIP Code: 11379, Complaint Type: HEAT/HOT WATER, Count: 24\n","ZIP Code: 11365, Complaint Type: HEAT/HOT WATER, Count: 16\n","ZIP Code: 11354, Complaint Type: HEAT/HOT WATER, Count: 48\n"]}],"source":["# check if count is updated correctly\n","def check_count_in_neo4j(graph):\n","    query = \"\"\"\n","    MATCH (z:Zip)-[r:HAS_COMPLAINT]->(c:ComplaintType)\n","    RETURN z.code AS zip_code, c.type AS complaint_type, r.count AS count\n","    LIMIT 10;\n","    \"\"\"\n","\n","    result = graph.run(query).data()\n","\n","    print(\"Results:\")\n","    for row in result:\n","        print(f\"ZIP Code: {row['zip_code']}, Complaint Type: {row['complaint_type']}, Count: {row['count']}\")\n","\n","\n","check_count_in_neo4j(graph)"]},{"cell_type":"markdown","id":"a239b4e3","metadata":{"id":"a239b4e3"},"source":["query"]},{"cell_type":"code","execution_count":null,"id":"7cd91e41","metadata":{"id":"7cd91e41"},"outputs":[],"source":["#Define the query: Query the top 5 complaint types for a given ZIP code\n","def get_top_complaint_types_for_zip(zip_code):\n","    query = \"\"\"\n","    MATCH (z:Zip {code: $zip_code})-[r:HAS_COMPLAINT]->(c:ComplaintType)\n","    RETURN c.type AS complaint_type, SUM(r.count) AS total_complaints\n","    ORDER BY total_complaints DESC\n","    LIMIT 5;\n","    \"\"\"\n","    # Execute the query and return the results\n","    result = graph.run(query, zip_code=zip_code).data()\n","\n","    # print result\n","    for row in result:\n","        print(f\"Complaint Type: {row['complaint_type']}, Complaints: {row['total_complaints']}\")\n","\n","    return result"]},{"cell_type":"code","execution_count":null,"id":"9ea0acb4","metadata":{"id":"9ea0acb4","outputId":"b3ae4db9-3ede-47ec-e41c-c0371eed899e"},"outputs":[{"name":"stdout","output_type":"stream","text":["Complaint Type: PAINT/PLASTER, Complaints: 1762\n","Complaint Type: ABANDONED VEHICLE, Complaints: 1532\n","Complaint Type: WATER LEAK, Complaints: 1304\n","Complaint Type: DERELICT VEHICLES, Complaints: 1020\n","Complaint Type: ELECTRIC, Complaints: 917\n"]},{"data":{"text/plain":["[{'complaint_type': 'PAINT/PLASTER', 'total_complaints': 1762},\n"," {'complaint_type': 'ABANDONED VEHICLE', 'total_complaints': 1532},\n"," {'complaint_type': 'WATER LEAK', 'total_complaints': 1304},\n"," {'complaint_type': 'DERELICT VEHICLES', 'total_complaints': 1020},\n"," {'complaint_type': 'ELECTRIC', 'total_complaints': 917}]"]},"execution_count":36,"metadata":{},"output_type":"execute_result"}],"source":["# Example: Query the complaint types for ZIP code 10001\n","zip_code = \"10001\"\n","get_top_complaint_types_for_zip(zip_code)"]},{"cell_type":"code","execution_count":null,"id":"336aa62f","metadata":{"id":"336aa62f","outputId":"6aaa7052-3a8f-43ad-f098-89bfa76d9521"},"outputs":[{"name":"stdout","output_type":"stream","text":["Top 5 Complaints:\n","Complaint Type: NOISE - HELICOPTER, Complaints: 626\n","Complaint Type: SAFETY, Complaints: 469\n","Complaint Type: ELECTRONICS WASTE APPOINTMENT, Complaints: 276\n","Complaint Type: DEAD ANIMAL, Complaints: 217\n","Complaint Type: RESIDENTIAL DISPOSAL COMPLAINT, Complaints: 200\n","\n","Least 5 Complaints:\n","Complaint Type: ENCAMPMENT, Complaints: 1\n","Complaint Type: FOOD ESTABLISHMENT, Complaints: 1\n","Complaint Type: NON-EMERGENCY POLICE MATTER, Complaints: 1\n","Complaint Type: SMOKING, Complaints: 1\n","Complaint Type: STREET SIGN - DAMAGED, Complaints: 1\n"]},{"data":{"text/plain":["([{'complaint_type': 'NOISE - HELICOPTER', 'complaints': 626},\n","  {'complaint_type': 'SAFETY', 'complaints': 469},\n","  {'complaint_type': 'ELECTRONICS WASTE APPOINTMENT', 'complaints': 276},\n","  {'complaint_type': 'DEAD ANIMAL', 'complaints': 217},\n","  {'complaint_type': 'RESIDENTIAL DISPOSAL COMPLAINT', 'complaints': 200}],\n"," [{'complaint_type': 'ENCAMPMENT', 'complaints': 1},\n","  {'complaint_type': 'FOOD ESTABLISHMENT', 'complaints': 1},\n","  {'complaint_type': 'NON-EMERGENCY POLICE MATTER', 'complaints': 1},\n","  {'complaint_type': 'SMOKING', 'complaints': 1},\n","  {'complaint_type': 'STREET SIGN - DAMAGED', 'complaints': 1}])"]},"execution_count":37,"metadata":{},"output_type":"execute_result"}],"source":["def get_top_and_least_complaints(zip_code):\n","    # query most common complaint type (top5)\n","    query_top = \"\"\"\n","    MATCH (z:Zip {code: $zip_code})-[r:HAS_COMPLAINT]->(c:ComplaintType)\n","    WITH c, SUM(r.count) AS total_complaints\n","    ORDER BY total_complaints DESC\n","    LIMIT 5\n","    RETURN c.type AS complaint_type, total_complaints AS complaints;\n","    \"\"\"\n","\n","    # query least common complaint type (top5)\n","    query_least = \"\"\"\n","    MATCH (z:Zip {code: $zip_code})-[r:HAS_COMPLAINT]->(c:ComplaintType)\n","    WITH c, SUM(r.count) AS total_complaints\n","    ORDER BY total_complaints ASC\n","    LIMIT 5\n","    RETURN c.type AS complaint_type, total_complaints AS complaints;\n","    \"\"\"\n","\n","    # Execute the query and return the results\n","    result_top = graph.run(query_top, zip_code=zip_code).data()\n","    result_least = graph.run(query_least, zip_code=zip_code).data()\n","\n","    # print result\n","    print(\"Top 5 Complaints:\")\n","    for row in result_top:\n","        print(f\"Complaint Type: {row['complaint_type']}, Complaints: {row['complaints']}\")\n","\n","    print(\"\\nLeast 5 Complaints:\")\n","    for row in result_least:\n","        print(f\"Complaint Type: {row['complaint_type']}, Complaints: {row['complaints']}\")\n","\n","    return result_top, result_least\n","\n","# Example: Query the complaint types for ZIP code 11101\n","zip_code = '11101'\n","get_top_and_least_complaints(zip_code)"]},{"cell_type":"code","execution_count":null,"id":"478bd11e","metadata":{"id":"478bd11e"},"outputs":[],"source":["def get_top_and_least_zip_for_complaint(complaint_type, graph):\n","    # query zip code with most complaint about (e.g NOISE - STREET/SIDEWALK )\n","    query_top = \"\"\"\n","    MATCH (z:Zip)-[r:HAS_COMPLAINT]->(c:ComplaintType {type: $complaint_type})\n","    RETURN z.code AS zip_code, SUM(r.count) AS total_complaints\n","    ORDER BY total_complaints DESC\n","    LIMIT 1;\n","    \"\"\"\n","\n","    # query zip code with least complaint about (e.g NOISE - STREET/SIDEWALK )\n","    query_least = \"\"\"\n","    MATCH (z:Zip)-[r:HAS_COMPLAINT]->(c:ComplaintType {type: $complaint_type})\n","    RETURN z.code AS zip_code, SUM(r.count) AS total_complaints\n","    ORDER BY total_complaints ASC\n","    LIMIT 1;\n","    \"\"\"\n","\n","    # Execute the query and return the results\n","    result_top = graph.run(query_top, complaint_type=complaint_type).data()\n","    result_least = graph.run(query_least, complaint_type=complaint_type).data()\n","\n","    # print result\n","    if result_top:\n","        print(f\"Most Complaints for Complaint Type: {complaint_type}\")\n","        print(f\"ZIP Code: {result_top[0]['zip_code']}, Complaints: {result_top[0]['total_complaints']}\")\n","\n","    if result_least:\n","        print(f\"\\nLeast Complaints for Complaint Type: {complaint_type}\")\n","        print(f\"ZIP Code: {result_least[0]['zip_code']}, Complaints: {result_least[0]['total_complaints']}\")\n","\n","    return result_top, result_least\n","\n"]},{"cell_type":"code","execution_count":null,"id":"593936cb","metadata":{"id":"593936cb","outputId":"45a0f174-8cc3-4756-c17e-7858d54e5a2c"},"outputs":[{"name":"stdout","output_type":"stream","text":["Most Complaints for Complaint Type: NOISE - STREET/SIDEWALK\n","ZIP Code: 10305, Complaints: 1466\n","\n","Least Complaints for Complaint Type: NOISE - STREET/SIDEWALK\n","ZIP Code: 11379, Complaints: 1\n"]},{"data":{"text/plain":["([{'zip_code': '10305', 'total_complaints': 1466}],\n"," [{'zip_code': '11379', 'total_complaints': 1}])"]},"execution_count":34,"metadata":{},"output_type":"execute_result"}],"source":["# use NOISE - STREET/SIDEWALK as example\n","complaint_type = \"NOISE - STREET/SIDEWALK\"\n","get_top_and_least_zip_for_complaint(complaint_type, graph)"]},{"cell_type":"code","execution_count":null,"id":"da26e5ca","metadata":{"id":"da26e5ca"},"outputs":[],"source":[]}],"metadata":{"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.9.13"},"colab":{"provenance":[]}},"nbformat":4,"nbformat_minor":5}